{
  "skills": [
    {
      "skill": "HTML5, CSS3",
      "description": "HTML5 and CSS3 have been at the forefront of my work for longer than any of the modern JS libraries that seem to get much of the attention today.\nAs the literal foundation on which anything rendered in a browser is built, I recognise that a good understanding of these technologies is absolutely crucial to their effective utilisation."
    },
    {
      "skill": "React",
      "description": "React is the UI library with which I feel most comfortable, and as such I generally use it for all web projects. I find it to be the most dynamic, straightforward, and logical way to build a user interface for the web.\nI began learning React in early 2016, and it has since become the tool that I reach for in almost every use case."
    },
    {
      "skill": "Node.js",
      "description": "I've been using Node for several years now; it is my primary language for backend development. The benefits of writing frontend and backend code in the same language are well documented, and for me it makes universal apps and full-stack development incredibly efficient and straightforward to accomplish."
    },
    {
      "skill": "GraphQL, Apollo",
      "description": "In early 2018, I began a project that would require some complex data storage and retrieval. I decided to combine this with an opportunity to learn GraphQL, specifically using Apollo, as the most developed Graph solution available. I integrated Apollo Server into my existing backend code, and built the frontend with Apollo from the start.\nAlthough I have much more to learn in this area, I can immediately see the benefits of using GraphQL over traditional REST APIs (where possible,) and I intend to prioritise development of this skill in the future."
    },
    {
      "skill": "CSS-in-JS; Styled Components",
      "description": "Although I have experience with SASS, Less, and CSS preprocessors in general, they sometimes feel like a stopgap solution to a problem that requires an entirely new outlook. My favoured approach is CSS-in-JS, by way of Styled Components.\nMaintaining a separate part of a codebase in another language with poor integration seems a little inefficient; I prefer the declarative and component-oriented nature of SC, and I've made great use of it in recent projects."
    },
    {
      "skill": "Redux",
      "description": "In the time before React's Context API became more widely used, I used Redux for all global state management. I've used Redux for a few projects, and although I've now replaced it with React's Context API and Apollo in a few of them, I still use it, and it is a skill I actively maintain."
    },
    {
      "skill": "Git",
      "description": "All of my projects rely on Git for revision control; it is a tool I could not do without in any development project at scale.\nI generally try to stick to a clear branching practice for resolving bugs and developing new features, before merging changes into a development branch for testing, then to master for deployment."
    },
    {
      "skill": "Amazon Web Services",
      "description": "As the trend towards decentralised cloud-computing continues to gain momentum, I have invested some time in learning how to use AWS effectively.\nAlthough lack of practical necessity has limited my development in this area so far, it is a skill that I intend to improve in the near future."
    },
    {
      "skill": "Databases, MySQL",
      "description": "I generally use MySQL in my projects, although I have experience with some NoSQL solutions, such as Mongo.\nI have a good grasp of SQL and its syntax, but I generally use the Sequelize JS library for data modelling and abstraction in the app."
    },
    {
      "skill": "Webpack",
      "description": "Webpack is a key part of my standard stack. I find it to be the most efficient and well-supported tool for web app deployment.\nI also have experience with various task runners and other tools, e.g. Grunt and Gulp."
    },
    {
      "skill": "Adobe (Illustrator, Photoshop, InDesign)",
      "description": "I have over 15 years' experience using Photoshop and other common Adobe tools."
    },
    {
      "skill": "Microsoft Windows 10",
      "description": "Much of my work experience has involved managing and supporting Windows systems."
    },
    {
      "skill": "MacOS",
      "description": "As a native Mac user, I have a strong affinity for macOS and Apple systems in general."
    },
    {
      "skill": "Linux",
      "description": "I first used Debian GNU/Linux on an iMac G3 in the early 2000s – I've since developed a great deal of skills in using and managing Linux systems, including server solutions. I currently maintain several Linux-based web and mail servers, using nginx, Apache, Dovecot, Postfix, and other common Linux server software."
    }
  ]
}